In [49]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

### P1 - Pandas in Python

In [3]:
tips = sns.load_dataset("tips")

In [4]:
# to_numpy

x = tips.to_numpy()
x

array([[16.99, 1.01, 'Female', ..., 'Sun', 'Dinner', 2],
       [10.34, 1.66, 'Male', ..., 'Sun', 'Dinner', 3],
       [21.01, 3.5, 'Male', ..., 'Sun', 'Dinner', 3],
       ...,
       [22.67, 2.0, 'Male', ..., 'Sat', 'Dinner', 2],
       [17.82, 1.75, 'Male', ..., 'Sat', 'Dinner', 2],
       [18.78, 3.0, 'Female', ..., 'Thur', 'Dinner', 2]], dtype=object)

In [5]:
# sort_index

tips.sort_index(axis=0, ascending=False)

     total_bill   tip     sex smoker   day    time  size
243       18.78  3.00  Female     No  Thur  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
240       27.18  2.00  Female    Yes   Sat  Dinner     2
239       29.03  5.92    Male     No   Sat  Dinner     3
..          ...   ...     ...    ...   ...     ...   ...
4         24.59  3.61  Female     No   Sun  Dinner     4
3         23.68  3.31    Male     No   Sun  Dinner     2
2         21.01  3.50    Male     No   Sun  Dinner     3
1         10.34  1.66    Male     No   Sun  Dinner     3
0         16.99  1.01  Female     No   Sun  Dinner     2

[244 rows x 7 columns]

In [6]:
# sort_values 

tips.sort_values(by='tip', ascending=False).head()

     total_bill    tip   sex smoker   day    time  size
170       50.81  10.00  Male    Yes   Sat  Dinner     3
212       48.33   9.00  Male     No   Sat  Dinner     4
23        39.42   7.58  Male     No   Sat  Dinner     4
59        48.27   6.73  Male     No   Sat  Dinner     4
141       34.30   6.70  Male     No  Thur   Lunch     6

### P2 - Pandas in Python

In [7]:
# iat

tips.iat[0, 0]

16.99

### P3 - Sampling

In [8]:
# sample with n

tips.tip.sample(n=4)

233    1.47
210    2.00
203    2.50
187    2.00
Name: tip, dtype: float64

In [9]:
# sample with frac

tips.tip.sample(frac=0.02)

174    4.00
221    3.48
37     3.07
217    1.50
44     5.60
Name: tip, dtype: float64

In [10]:
# replace, if true a number can be sampled twice

tips.tip.sample(frac=0.02, replace=True)

220    2.2
67     1.0
212    9.0
149    2.0
140    3.5
Name: tip, dtype: float64

In [11]:
# weights: sample series

from sklearn.preprocessing import scale
weights = abs(scale(tips.tip))  # just to simulate some weights

tips.tip.sample(n=4, weights=weights)

23     7.58
3      3.31
239    5.92
67     1.00
Name: tip, dtype: float64

In [12]:
# weights: sample df

tips.tip.sample(n=4, weights=weights)

140    3.50
12     1.57
59     6.73
27     2.00
Name: tip, dtype: float64

### P4 - Accessing Data

In [13]:
# append

tips.tip.append(pd.Series([99])).reset_index(drop=True)

0       1.01
1       1.66
2       3.50
3       3.31
4       3.61
       ...
240     2.00
241     2.00
242     1.75
243     3.00
244    99.00
Length: 245, dtype: float64

### P5 - isin, where, mask

In [14]:
# isin: can take dict, but looks like we have to provide all columns
# all vs any

d = {
    "sex": ["Female"],
    "smoker": ["No"],
    "day": ["Sun"],
    "time": ["Dinner"]
}

tips.isin(d).all(axis=1).head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [15]:
# where, returns all rows. non-matches will be NaN

tips.where(tips.tip > 2).head()

   total_bill   tip     sex smoker  day    time  size
0         NaN   NaN     NaN    NaN  NaN     NaN   NaN
1         NaN   NaN     NaN    NaN  NaN     NaN   NaN
2       21.01  3.50    Male     No  Sun  Dinner   3.0
3       23.68  3.31    Male     No  Sun  Dinner   2.0
4       24.59  3.61  Female     No  Sun  Dinner   4.0

In [16]:
# will only return matches

tips[tips.tip > 2].head()

   total_bill   tip     sex smoker  day    time  size
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
7       26.88  3.12    Male     No  Sun  Dinner     4

In [17]:
# other, replaces nan

tips[['tip']].where(tips.tip > 2, other=999).head()

      tip
0  999.00
1  999.00
2    3.50
3    3.31
4    3.61

In [18]:
# mask, exact opposite of where

tips[['tip']].mask(tips.tip > 2, other=999).head()

      tip
0    1.01
1    1.66
2  999.00
3  999.00
4  999.00

In [19]:
# where match, replace with another column

tips[['tip']].where(tips[['tip']] > 3, tips['total_bill'], axis=0).head()

     tip
0  16.99
1  10.34
2   3.50
3   3.31
4   3.61

### P6 - duplicates

In [20]:
# duplicated, keep (first, last, False)

tips.duplicated(['sex', 'time', 'smoker', 'day', 'size'], keep='first')

0      False
1      False
2       True
3      False
4      False
       ...
239     True
240     True
241     True
242     True
243    False
Length: 244, dtype: bool

In [21]:
# get by index

tips['sex'].get(1)

'Male'

### P7 - Index

In [22]:
# append

tips.set_index("sex", append=True).head()

          total_bill   tip smoker  day    time  size
  sex
0 Female       16.99  1.01     No  Sun  Dinner     2
1 Male         10.34  1.66     No  Sun  Dinner     3
2 Male         21.01  3.50     No  Sun  Dinner     3
3 Male         23.68  3.31     No  Sun  Dinner     2
4 Female       24.59  3.61     No  Sun  Dinner     4

### P9 - Concat & Append

In [23]:
tips1 = tips.sample(frac=.5)
tips2 = tips.sample(frac=.5)

In [24]:
# keys 

tips_concat = pd.concat([tips1, tips2], keys=['a', 'b'])
tips_concat.head()

       total_bill   tip     sex smoker  day    time  size
a 161       12.66  2.50    Male     No  Sun  Dinner     2
  173       31.85  3.18    Male    Yes  Sun  Dinner     2
  57        26.41  1.50  Female     No  Sat  Dinner     2
  32        15.06  3.00  Female     No  Sat  Dinner     2
  92         5.75  1.00  Female    Yes  Fri  Dinner     2

In [25]:
tips_concat.loc['b'].head()

     total_bill   tip     sex smoker   day    time  size
229       22.12  2.88  Female    Yes   Sat  Dinner     2
141       34.30  6.70    Male     No  Thur   Lunch     6
137       14.15  2.00  Female     No  Thur   Lunch     2
208       24.27  2.03    Male    Yes   Sat  Dinner     2
201       12.74  2.01  Female    Yes  Thur   Lunch     2

In [26]:
# axis=1, join

pd.concat([tips1, tips2], axis=1, join='outer')

,total_bill,tip,sex,smoker,day,time,size,total_bill,tip,sex,smoker,day,time,size
1,10.34,1.66,Male,No,Sun,Dinner,3.0,10.34,1.66,Male,No,Sun,Dinner,3.0
2,21.01,3.50,Male,No,Sun,Dinner,3.0,21.01,3.50,Male,No,Sun,Dinner,3.0
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,23.68,3.31,Male,No,Sun,Dinner,2.0
5,25.29,4.71,Male,No,Sun,Dinner,4.0,25.29,4.71,Male,No,Sun,Dinner,4.0
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8.77,2.00,Male,No,Sun,Dinner,2.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
237,32.83,1.17,Male,Yes,Sat,Dinner,2.0,32.83,1.17,Male,Yes,Sat,Dinner,2.0
238,NaN,NaN,NaN,NaN,NaN,NaN,NaN,35.83,4.67,Female,No,Sat,Dinner,3.0
240,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.18,2.00,Female,Yes,Sat,Dinner,2.0
242,17.82,1.75,Male,No,Sat,Dinner,2.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
243,18.78,3.00,Female,No,Thur,Dinner,2.0,18.78,3.00,Female,No,Thur,Dinner,2.0

In [27]:
# reindex, adopt index of another dataframe,
# if the index of the right-hand df is not available inn the left db
# the records will be null

tips1.reindex(tips2.index)

     total_bill   tip     sex smoker   day    time  size
229       22.12  2.88  Female    Yes   Sat  Dinner   2.0
141       34.30  6.70    Male     No  Thur   Lunch   6.0
137         NaN   NaN     NaN    NaN   NaN     NaN   NaN
208         NaN   NaN     NaN    NaN   NaN     NaN   NaN
201         NaN   NaN     NaN    NaN   NaN     NaN   NaN
..          ...   ...     ...    ...   ...     ...   ...
49        18.04  3.00    Male     No   Sun  Dinner   2.0
44          NaN   NaN     NaN    NaN   NaN     NaN   NaN
52        34.81  5.20  Female     No   Sun  Dinner   4.0
1         10.34  1.66    Male     No   Sun  Dinner   3.0
189         NaN   NaN     NaN    NaN   NaN     NaN   NaN

[122 rows x 7 columns]

In [28]:
# appendinng more than 2 df

tips1.append([tips2, tips]).head()

     total_bill   tip     sex smoker  day    time  size
161       12.66  2.50    Male     No  Sun  Dinner     2
173       31.85  3.18    Male    Yes  Sun  Dinner     2
57        26.41  1.50  Female     No  Sat  Dinner     2
32        15.06  3.00  Female     No  Sat  Dinner     2
92         5.75  1.00  Female    Yes  Fri  Dinner     2

In [29]:
# ignore_index 

pd.concat([tips1, tips2], ignore_index=True).head()

   total_bill   tip     sex smoker  day    time  size
0       12.66  2.50    Male     No  Sun  Dinner     2
1       31.85  3.18    Male    Yes  Sun  Dinner     2
2       26.41  1.50  Female     No  Sat  Dinner     2
3       15.06  3.00  Female     No  Sat  Dinner     2
4        5.75  1.00  Female    Yes  Fri  Dinner     2

In [36]:
# validate = 'one_to_one', 'one_to_many' etc

pd.merge(tips1, tips2, on=['sex', 'smoker', 'day', 'time', 'size'], validate='many_to_many').head()

   total_bill_x  tip_x   sex smoker  day    time  size  total_bill_y  tip_y
0         12.66    2.5  Male     No  Sun  Dinner     2         13.94   3.06
1         12.66    2.5  Male     No  Sun  Dinner     2         10.27   1.71
2         12.66    2.5  Male     No  Sun  Dinner     2         14.07   2.50
3         12.66    2.5  Male     No  Sun  Dinner     2         12.66   2.50
4         12.66    2.5  Male     No  Sun  Dinner     2         15.04   1.96

In [37]:
# indicator, most helpful when how='outer'

pd.merge(tips1, tips2, on=['sex', 'smoker', 'day', 'time', 'size'], indicator='indic_col').head()

,total_bill_x,tip_x,sex,smoker,day,time,size,total_bill_y,tip_y,indic_col
0,12.66,2.5,Male,No,Sun,Dinner,2,13.94,3.06,both
1,12.66,2.5,Male,No,Sun,Dinner,2,10.27,1.71,both
2,12.66,2.5,Male,No,Sun,Dinner,2,14.07,2.50,both
3,12.66,2.5,Male,No,Sun,Dinner,2,12.66,2.50,both
4,12.66,2.5,Male,No,Sun,Dinner,2,15.04,1.96,both

In [44]:
# combine_first

df1 = pd.DataFrame({
    "A": [np.nan, 999],
    "B": [7, np.nan]
})
df1.head()

       A    B
0    NaN  7.0
1  999.0  NaN

In [45]:
df2 = pd.DataFrame({
    "A": [np.nan, 1],
    "B": [777, 8687]
})
df2.head()

     A     B
0  NaN   777
1  1.0  8687

In [46]:
# NaN in the df1 is replaced with non-null value in df2

df1.combine_first(df2)

       A       B
0    NaN     7.0
1  999.0  8687.0

In [47]:
# updates the non-null values as well

df1.update(df2)
df1.head()

     A       B
0  NaN   777.0
1  1.0  8687.0

### P10 - Pivot, stack, unstack

In [51]:
df1 = pd.DataFrame({
    'month': ['jan', 'jan', 'jan', 'mar', 'mar', 'mar', 'dec'],
    'day': ['mon', 'wed', 'thu', 'mon', 'wed', 'thu', 'mon'],
    'A': [1, 2, 3, 4, 5, 6, 7],
    'B': [10, 20, 30, 40, 50, 60, 70],
})

df1.head()

  month  day  A   B
0   jan  mon  1  10
1   jan  wed  2  20
2   jan  thu  3  30
3   mar  mon  4  40
4   mar  wed  5  50

In [59]:
tuple_list1 = list(zip(
    ['rain', 'rain', 'wind', 'wind'],
    ['stone', 'river', 'stone', 'river']
))

index2 = pd.MultiIndex.from_tuples(tuple_list1, names=['weather', 'geology'])

df2 = pd.DataFrame(
    {
        'day': ['sun', 'sun', 'tue', 'tue'],
        'time': ['morning', 'evening', 'morning', 'evening'],
        'harvest': [1, 2, 3, 4],
        'seed': [12, 23, 34, 45]
    },
    index=index2
)

df2.head()

                 day     time  harvest  seed
weather geology
rain    stone    sun  morning        1    12
        river    sun  evening        2    23
wind    stone    tue  morning        3    34
        river    tue  evening        4    45

In [61]:
index3 = pd.MultiIndex.from_product([[3, 1], [9, 0]])
df3 = pd.DataFrame(np.random.randn(4), index=index3, columns=["Z"])
df3.head()

            Z
3 9  0.509486
  0 -0.649687
1 9 -1.143977
  0  1.596885

In [65]:
tuple_index4 = list(zip(
    ['tree', 'tree', 'tree', 'leaves', 'leaves', 'leaves'],
    ['plant', 'plant', 'soil', 'soil', 'fruit', 'fruit'],
    ['rain', 'cloud', 'rain', 'cloud', 'rain', 'cloud'],
))

index4 = pd.MultiIndex.from_tuples(tuple_index4, names=['Forest', 'Farm', 'Weather'])
df4 = pd.DataFrame(
    {
        'A': [1, 2, 3, 4, 5, 6],
        'B': [55, 66, 77, 88, 99, 100],
    },
    index=index4
)
df4.head(6)

                      A    B
Forest Farm  Weather
tree   plant rain     1   55
             cloud    2   66
       soil  rain     3   77
leaves soil  cloud    4   88
       fruit rain     5   99
             cloud    6  100

In [72]:
columns = pd.MultiIndex.from_tuples([
    ('car', 'petrol'),
    ('truck', 'diesel'),
    ('truck', 'diesel'),
    ('car', 'petrol')],
    names=['vehicle', 'fuel']
)

index = pd.MultiIndex.from_product(
    [
        ('tar_road', 'concrete_road', 'gravel_road', 'mud_road'),
        ('one_way', 'two_way')
    ],
    names=['transp', 'freq']
)

df5 = pd.DataFrame(
    np.random.randint(10, 30, (8, 4)),
    columns=columns,
    index=index
)
df5.head()

vehicle                  car  truck           car
fuel                  petrol diesel diesel petrol
transp        freq
tar_road      one_way     17     11     19     23
              two_way     26     21     10     14
concrete_road one_way     15     11     21     24
              two_way     25     16     23     16
gravel_road   one_way     26     13     17     17

In [77]:
df6 = pd.DataFrame({
    'month': ['jan', 'jan', 'jan', 'jan', 'jan', 'feb', 'feb', 'feb', 'feb', 'feb'],
    'week': ['first', 'first', 'first', 'second', 'second', 'first', 'first', 'first', 'second', 'second'],
    'suger_sold': [10, 5, 20, 11, 19, 34, 54, 23, 12, 29],
    'salt_sold': [22, 44, 55, 44, 66, 33, 55, 67, 33, 56],
})

df6.head()

  month    week  suger_sold  salt_sold
0   jan   first          10         22
1   jan   first           5         44
2   jan   first          20         55
3   jan  second          11         44
4   jan  second          19         66

#### pivot

In [76]:
df1

  month  day  A   B
0   jan  mon  1  10
1   jan  wed  2  20
2   jan  thu  3  30
3   mar  mon  4  40
4   mar  wed  5  50
5   mar  thu  6  60
6   dec  mon  7  70

In [81]:
df1_pivot = df1.pivot(index='month', columns='day', values=['A', 'B'])
df1_pivot

         A               B
day    mon  thu  wed   mon   thu   wed
month
dec    7.0  NaN  NaN  70.0   NaN   NaN
jan    1.0  3.0  2.0  10.0  30.0  20.0
mar    4.0  6.0  5.0  40.0  60.0  50.0

In [83]:
df1_pivot['B']

day     mon   thu   wed
month
dec    70.0   NaN   NaN
jan    10.0  30.0  20.0
mar    40.0  60.0  50.0

#### stack

In [85]:
df2

                 day     time  harvest  seed
weather geology
rain    stone    sun  morning        1    12
        river    sun  evening        2    23
wind    stone    tue  morning        3    34
        river    tue  evening        4    45

In [105]:
# level 

df2_stacked = df2.stack(level=0)
df2_stacked

weather  geology
rain     stone    day            sun
                  time       morning
                  harvest          1
                  seed            12
         river    day            sun
                  time       evening
                  harvest          2
                  seed            23
wind     stone    day            tue
                  time       morning
                  harvest          3
                  seed            34
         river    day            tue
                  time       evening
                  harvest          4
                  seed            45
dtype: object

In [107]:
# level 

df2_stacked.unstack(level='weather')   # or level = 0

weather             rain     wind
geology
river   day          sun      tue
        time     evening  evening
        harvest        2        4
        seed          23       45
stone   day          sun      tue
        time     morning  morning
        harvest        1        3
        seed          12       34

#### sort during stack/unstack

In [109]:
df3

            Z
3 9  0.509486
  0 -0.649687
1 9 -1.143977
  0  1.596885

In [111]:
# indeces are sorted after unstach/stack

df3.unstack().stack()

            Z
1 0  1.596885
  9 -1.143977
3 0 -0.649687
  9  0.509486

#### pivot_table

In [123]:
df6

  month    week  suger_sold  salt_sold
0   jan   first          10         22
1   jan   first           5         44
2   jan   first          20         55
3   jan  second          11         44
4   jan  second          19         66
5   feb   first          34         33
6   feb   first          54         55
7   feb   first          23         67
8   feb  second          12         33
9   feb  second          29         56

In [ ]:
# index contains duplicate records, cannot reshape

df6.pivot(index='month', columns='week', values='suger_sold')

In [127]:
# we get mean values! 

df6.pivot_table(index='month', columns='week', values='suger_sold', aggfunc=np.mean)

week       first  second
month
feb    37.000000    20.5
jan    11.666667    15.0

### P11 - Groupby, Melt, Stack, Unstack, Get Dummies

In [130]:
df1 = pd.DataFrame({
    'month': ['jan', 'jan', 'jan', 'mar', 'mar', 'mar'],
    'day': ['mon', 'wed', 'thu', 'mon', 'wed', 'thu'],
    'A': [1, 2, 3, 4, 5, 6],
    'B': [10, 20, 30, 40, 50, 60],
})

df1

  month  day  A   B
0   jan  mon  1  10
1   jan  wed  2  20
2   jan  thu  3  30
3   mar  mon  4  40
4   mar  wed  5  50
5   mar  thu  6  60

In [131]:
np.random.seed(9)

df7 = pd.DataFrame({
    "car1990": [25, 22, 23, 20],
    "car2000": [22, 23, 25, 27],
    "car2010": [25, 24, 27, 30],
    "bike1990": [78, 79, 67, 66],
    "bike2000": [78, 79, 88, 77],
    "bike2010": [88, 85, 90, 79],
    "rating": np.random.randint(1, 5, 4),
    "end_use": ["race", "commute", "offroad", "transport"],
    "surface": ["tar", "concrete", "gravel", "mixed"]
})

df7["id"] = df7.index
df7

,car1990,car2000,car2010,bike1990,bike2000,bike2010,rating,end_use,surface,id
0,25,22,25,78,78,88,3,race,tar,0
1,22,23,24,79,79,85,1,commute,concrete,1
2,23,25,27,67,88,90,3,offroad,gravel,2
3,20,27,30,66,77,79,2,transport,mixed,3

#### melt

In [134]:
df1

  month  day  A   B
0   jan  mon  1  10
1   jan  wed  2  20
2   jan  thu  3  30
3   mar  mon  4  40
4   mar  wed  5  50
5   mar  thu  6  60

In [136]:
df1.melt(id_vars=["month", "day"], var_name='chars').head()

  month  day chars  value
0   jan  mon     A      1
1   jan  wed     A      2
2   jan  thu     A      3
3   mar  mon     A      4
4   mar  wed     A      5

#### wide_to_long

In [139]:
df7

,car1990,car2000,car2010,bike1990,bike2000,bike2010,rating,end_use,surface,id
0,25,22,25,78,78,88,3,race,tar,0
1,22,23,24,79,79,85,1,commute,concrete,1
2,23,25,27,67,88,90,3,offroad,gravel,2
3,20,27,30,66,77,79,2,transport,mixed,3

In [150]:
pd.wide_to_long(df7, stubnames=['car', 'bike'], i='id', j='year').head()

           end_use   surface  rating  car  bike
id year
0  1990       race       tar       3   25    78
1  1990    commute  concrete       1   22    79
2  1990    offroad    gravel       3   23    67
3  1990  transport     mixed       2   20    66
0  2000       race       tar       3   22    78

In [149]:
dfn = df1.copy()
dfn['C'] = dfn['A'] * 2
dfn['D'] = dfn['B'] * 2

dfn = dfn.set_index(['month', 'day'])

dfn.columns = pd.MultiIndex.from_product(
    [
        ('lower', 'upper'),
        ('A', 'B'),
    ],
    names=['floor', 'unit']
)

dfn

floor     lower     upper
unit          A   B     A    B
month day
jan   mon     1  10     2   20
      wed     2  20     4   40
      thu     3  30     6   60
mar   mon     4  40     8   80
      wed     5  50    10  100
      thu     6  60    12  120

In [153]:
# level & axis in groupby

dfn.groupby(level=1, axis=1).mean()

unit         A     B
month day
jan   mon  1.5  15.0
      wed  3.0  30.0
      thu  4.5  45.0
mar   mon  6.0  60.0
      wed  7.5  75.0
      thu  9.0  90.0

#### get_dummies

In [154]:
df1

  month  day  A   B
0   jan  mon  1  10
1   jan  wed  2  20
2   jan  thu  3  30
3   mar  mon  4  40
4   mar  wed  5  50
5   mar  thu  6  60

In [161]:
# get_dummies

pd.get_dummies(df1, columns=['month'], prefix='m')

   day  A   B  m_jan  m_mar
0  mon  1  10      1      0
1  wed  2  20      1      0
2  thu  3  30      1      0
3  mon  4  40      0      1
4  wed  5  50      0      1
5  thu  6  60      0      1

In [160]:
# multiple cols

pd.get_dummies(df1, columns=['month', 'day'], prefix={"month": 'm', "day": "d"})

   A   B  m_jan  m_mar  d_mon  d_thu  d_wed
0  1  10      1      0      1      0      0
1  2  20      1      0      0      0      1
2  3  30      1      0      0      1      0
3  4  40      0      1      1      0      0
4  5  50      0      1      0      0      1
5  6  60      0      1      0      1      0

In [162]:
# drop_first

pd.get_dummies(df1, columns=['month', 'day'], prefix={"month": 'm', "day": "d"}, drop_first=True)

   A   B  m_mar  d_thu  d_wed
0  1  10      0      0      0
1  2  20      0      0      1
2  3  30      0      1      0
3  4  40      1      0      0
4  5  50      1      0      1
5  6  60      1      1      0

In [163]:
# values & aggfunc

pd.crosstab(df1['month'], df1['day'], values=df1['A'], aggfunc=sum)

day    mon  thu  wed
month
jan      1    3    2
mar      4    6    5

### P12 - Strings

### P13 - Regex

### P14 - Walkthrough Example

### P15 - Missing Value